{
  "posts": [
    {
      "id": 1,
      "title": "How To Find A Workout Buddy",
      "date": "Dec 26, 2022",
      "author_id": 1,
      "image": "1672077157087_tips-for-finding-the-perfect-workout-buddy.jpg",
      "category_id": 5,
      "likes_user_id": [
        1
      ],
      "saved_user_id": [
        1
      ],
      "text": "Hey, you don’t need to be afraid to admit: It can get lonely out there. Whether you’re on the track, in the pool or deadlifting pieces of scrap metal in the local junk yard, working out is usually a solo grind. But sometimes it’s nice to have a **[workout buddy](https://blog.myfitnesspal.com/tips-for-hitting-goals-faster-with-a-virtual-accountability-partner/).**\r\n\r\nWhile sitting in the back row of spin class or running next to headphone-wearing treadmill zombies might feel like solidarity, it’s actually closer to solitude. And that’s not a bad thing. Working out is a time to focus on yourself, to clear your head. In many ways it’s therapeutic to have that time alone.\r\n\r\nBut getting a rigorous sweat in doesn’t mean you have to discipline yourself in some dark workout dungeon. Even when Bruce Wayne was trying to escape the Pit in “The Dark Knight Rises,” he had all of his prison boys chanting and cheering him on. And that’s one of the **[great things about workout buddies](https://blog.myfitnesspal.com/8-ways-your-partner-can-support-your-weight-loss-goals/)** (and prison buddies, I suppose).\r\n\r\nThere’s a sense that, “yeah, this is tough, but we’re all in this together.” So do yourself a favor, and consider calling a workout buddy once in awhile.\r\n\r\nBut don’t call just _anybody_.\r\n\r\nYou must weigh pros and cons — and consider the most prominent prior examples. Below are some readily available options for you to evaluate:\r\n\r\nIf you’re a morning workout person (or want to be), this option is worth exploring. Somebody who is most likely within shouting distance when you wake up is going to make it harder for you to sleep in and slack off. Same goes for sharing a fridge. If you’re trying to eat healthy, your roomie will make it harder for you to sneak Ben and Jerry’s. If you can commit to a routine, you’ll be able to easily motivate each other to get up in the morning, hit the gym and stay disciplined.\r\n\r\n**Con:** If you don’t prefer the same gym. Or if you hate your roommate.\r\n\r\n**Favorite example:** Jenko (Channing Tatum) and Zook (Wyatt Russell) in the workout montage scene in “22 Jump Street.” The QB/WR duo relentlessly pumping iron in their room together — _literally that’s all they do._"
    },
    {
      "id": 2,
      "title": "4 Ways to Squeeze in More Steps Over the Holidays",
      "date": "Jan 7, 2023",
      "author_id": 2,
      "image": "1673051363918_4-Ways-to-Squeeze-in-More-Steps-Over-the-Holidays.jpg",
      "category_id": 4,
      "likes_user_id": [],
      "saved_user_id": [],
      "text": "During the holidays, family and friends take priority, and it’s easy for normal routines to get pushed to the side. When you’re cooking for guests or waiting in long lines at the store, it can feel like you don’t have time for trips to the gym or even [at-home workouts](https://blog.myfitnesspal.com/quick-home-bodyweight-workout/).\r\n\r\nHowever, instead of letting your goals and [healthy habits](https://blog.myfitnesspal.com/8-ways-make-healthy-habit-stick/) get derailed, focus on ways you can squeeze [more steps](https://blog.myfitnesspal.com/essential-guide-walking-steps/) and activity into your holidays by incorporating your family. \r\n\r\n**1. SIGN UP FOR A TURKEY TROT**\r\n\r\nLocal races give the whole crew an opportunity to get up and move together. The good news is those turkey trots aren’t just for runners. Instead of focusing on pace, make a commitment to cross the start and finish line as a team. Discuss a racing plan — like alternating between jogging for 5 minutes and walking for 3 minutes — to help you get there together.\r\n\r\n**2. MAKE A FAMILY TRIP TO THE FARMERS MARKET**\r\n\r\nWhen you’re buying all of the ingredients for the holiday spread — from homemade stuffing to your brother’s signature sweet potato mash — there’s a lot of ground to cover. Instead of doing it at a standard grocery store, go to a [farmers market](https://blog.myfitnesspal.com/avoid-these-5-farmers-market-mistakes/) and bring your family. Not only will you have the opportunity to increase your step count, but you’ll also be able to take in the fresh air, find peak produce and support small farms. Not only are fresh fruits and vegetables [full of antioxidants and micronutrients](https://www.nutrition.gov/subject/shopping-cooking-meal-planning/farmers-markets), but buying local is a great way to give back to your community.\r\n\r\n**3. TAKE A WALK AFTER DESSERT**\r\n\r\nAfter a big meal, taking a walk together instead of sitting at the table or watching TV is simply a smart move. It’ll help with digestion and is a way to get some extra quality family time. Planning the walk for _before_ dessert is another option that might get people to [walk a little faster](https://blog.myfitnesspal.com/a-brisk-walk-can-help-you-live-longer/).\r\n\r\n**4. HOST A HOLIDAY SCAVENGER HUNT**\r\n\r\nStart a new family custom of organizing a scavenger hunt once everyone descends on your home for quality time. If it’s during Thanksgiving, you can hide small pieces of paper with everyone’s name on it. The name each family member finds during the scavenger hunt is the person they will give a small gift to come December. "
    },
    {
      "id": 3,
      "title": "Cinnamon Oatmeal with Dried Apples and Sultanas",
      "date": "Jan 7, 2023",
      "author_id": 2,
      "image": "1673051474572_Cinnamon-Oatmeal-with-Dried-Apples-and-Sultanas.jpg",
      "category_id": 1,
      "likes_user_id": [
        1
      ],
      "saved_user_id": [
        1
      ],
      "text": "Whereas standard raisins come from red grapes, sultanas are dried white grapes. They absorb the flavor of whatever dish they’re used in and are a great way to add natural sweetness. Try them with dried apple slices and cinnamon in this sweet oatmeal breakfast on a cool autumn morning.\r\n\r\n**Ingredients**\r\n\r\n- 1 3/4 cups water\r\n- 1 cup (100g) Quaker Oats\r\n- 1/2 cup (60g) dried apple slices\r\n- 1/2 cup (50g) sultanas\r\n- 1 teaspoon cinnamon\r\n\r\n**Directions**\r\n\r\nBoil water in a medium pot. Once the water is rolling, reduce heat to medium and stir in oats. Simmer uncovered, stirring occasionally, for about 5 minutes or until oats are desired texture.\r\n\r\nDivide cooked oatmeal into two bowls and top with the dried apple slices, sultanas and cinnamon. Serve hot.\r\n\r\n**Serves: 2 | Serving size: 1/2 of recipe**\r\n\r\n**Nutrition (per serving):** _Calories: 341; Total Fat: 3.3g; Saturated Fat: 0.6g; Monounsaturated Fat: 1g; Cholesterol: 0mg; Sodium: 49.1mg; Carbohydrate: 73.4g; Dietary Fiber: 16.1g; Sugar: 34.6g; Protein: 6.7g_ "
    },
    {
      "id": 4,
      "title": "High-Protein Chicken Salad",
      "date": "Jan 7, 2023",
      "author_id": 1,
      "image": "1673051656370_High-Protein-Chicken-Salad.jpeg",
      "category_id": 1,
      "likes_user_id": [],
      "saved_user_id": [],
      "text": "If you have leftover rotisserie chicken or cooked chicken breast, make this high-protein chicken salad as an easy lunch option. Lean shredded chicken is combined with creamy yogurt, crispy apples and sweet grapes for a tasty, tangy combo. Serve between 100% whole grain bread and you have a satisfying, packable lunch. If you’d rather go low-carb, you can sub in a side salad instead of the bread. \r\n\r\n**Ingredients**\r\n\r\n- 1 pound (454 grams) cooked chicken breast or rotisserie chicken, shredded (about 4 cups shredded)\r\n- 1/2 cup diced red onion (about 1/2 medium red onion or 60 grams)\r\n- 1/2 cup diced apple (about 1/2 small apple or 75 grams)\r\n- 2/3 cup (100 grams) quartered or halved grapes\r\n- 2/3 cup (165 grams) plain 2% fat Greek yogurt (certified gluten-free if necessary)\r\n- 2 tablespoon freshly squeezed lemon juice, or more, to taste\r\n- 1/2 teaspoon garlic powder\r\n- Salt and pepper, to taste\r\n- 12 slices of 100% whole grain bread (about 100 calories each)\r\n- 6 medium lettuce leaves\r\n\r\n**Directions**\r\n\r\nIn a large bowl, combine shredded chicken, red onion, apple, grapes, Greek yogurt, lemon juice, garlic powder, salt and pepper. Mix until well combined.\r\n\r\nUsing a 3/4 cup measuring scoop, portion out the chicken salad. Serve with a lettuce leaf and 2 slices of 100% whole grain bread.\r\n\r\n**Serves: 6 | Serving Size: 3/4 cup (about 5 ounces or 142 grams) + 2 slices whole grain bread + 1 medium lettuce leaf**\r\n\r\n**Nutrition (per serving):** _Calories: 364; Total Fat: 6g; Saturated Fat: 1g; Monounsaturated Fat: 1g; Cholesterol: 65mg; Sodium: 412mg; Carbohydrate: 44g; Dietary Fiber: 7g; Sugar: 10g; Protein: 34g_\r\n\r\n**Nutrition Bonus: **_Potassium: 249mg; Iron: 17%; Vitamin A: 1%; Vitamin C: 7%; Calcium: 12%_\r\n\r\n**Energizing Tips (optional)**\r\n\r\n- **Add 1/3 cup dried cranberries into the chicken salad before mixing to increase calories, carbs and sweetness.** _(Per serving: Calories: 384; Total Fat: 6g; Carbohydrate: 50g; Dietary Fiber: 7g; Sugar: 15g; Protein: 34g)_\r\n- **Add 1/2 cup chopped almonds or nut of choice into the chicken salad before mixing to increase calories, protein and healthy fats.** _(Per serving: Calories: 420; Total Fat: 11g; Carbohydrate: 46g; Dietary Fiber: 8g; Sugar: 11g; Protein: 36g)_ "
    },
    {
      "id": 5,
      "title": "How Much Weight Loss Can Actually Reverse Type 2 Diabetes?",
      "date": "Jan 7, 2023",
      "author_id": 1,
      "image": "1673051828658_How-Much-Weight-Loss-Can-Actually-Reverse-Type-2-Diabetes.jpg",
      "category_id": 3,
      "likes_user_id": [],
      "saved_user_id": [],
      "text": "Managing diabetes can be challenging, but the good news is losing weight can help increase the odds of remission — and it doesn’t have to be drastic. New **[research published in Diabetic Medicine](https://onlinelibrary.wiley.com/doi/full/10.1111/dme.14122)** shows people who lost 10% of their body fat in the first five years following a Type 2 diabetes diagnosis were more than twice as likely to put the disease into remission than those who maintained their weight. What’s more, participants in the 2019 study were not required to follow specific diets or exercise routines.\r\n\r\n“The existing evidence for achieving remission suggests extreme levels of exercise and rather restrictive diets; this is simply not realistic or achievable for my patients, especially in the longer-term [and] it is de-motivating for patients when they are unable to achieve large amounts of weight loss,” says lead author Dr. Hajira Dambha-Miller, PhD, a clinical lecturer in general practice at University of Cambridge. “Our study shows that small changes over a long period of time can be really meaningful.”\r\n\r\nType 2 diabetes is diagnosed when fat builds up in the liver and pancreas, switching off the genes that control insulin production. “In order to prevent diabetes, or reverse it once it happens, we need to decrease the need for insulin and therefore decrease the need for the pancreas to have to make so much of it,” explains Sarah Hallberg, medical director at Virta Health. Her **[research](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6520897/)** found a low-carb diet of less than 130 grams of carbohydrates per day helped with long-term remission.“Carbohydrates cause insulin and blood sugar to rise,” explains Hallberg. “If someone has insulin resistance long enough and continues to eat carbohydrates, especially refined carbohydrates, the pancreas can’t keep up with the demand for all additional insulin it needs [and] blood sugars start to rise.” That’s why it’s a good idea for those with diabetes to limit carb intake and, whenever possible, stick to complex carbs from whole grains and veggies, which don’t cause drastic spikes in blood sugar levels.\r\n\r\n_[Adding more movement to your life](https://blog.myfitnesspal.com/essential-guide-to-movement-activity/) and adopting a [low-carb diet](https://blog.myfitnesspal.com/ask-the-rd-how-can-i-have-more-energy-and-still-eat-low-carb/)_ can help with [sustainable weight loss](https://blog.myfitnesspal.com/4-tips-to-keep-the-weight-off-for-good/) and contribute to remission for people with Type 2 diabetes, says Hallberg. Aiming to lose 10% of your body weight over the course of five years from your diagnosis is a good place to start. Focus on setting realistic, sustainable [calorie](https://blog.myfitnesspal.com/ask-the-dietitian-should-i-eat-back-my-exercise-calories/) and [macro goals](https://blog.myfitnesspal.com/essential-guide-macros/) and [track your food intake with an app like MyFitnessPal](https://blog.myfitnesspal.com/essential-guide-to-myfitnesspal-premium/). You can also use the app to monitor your blood sugar levels, note the timing of your meals and make adjustments from there. At the end of the day, the key to [creating healthy habits is making them easy and enjoyable](https://blog.myfitnesspal.com/healthy-habits-for-life-10-tips-for-better-nutrition-and-weight-loss/)."
    }
  ],
  "categories": [
    {
      "id": 1,
      "title": "Recipes"
    },
    {
      "id": 2,
      "title": "Nutrition"
    },
    {
      "id": 3,
      "title": "Weight Los"
    },
    {
      "id": 4,
      "title": "Fitness"
    },
    {
      "id": 5,
      "title": "Inspiration"
    }
  ],
  "comments": [
    {
      "id": 1,
      "user_id": 1,
      "post_id": 1,
      "text": "Great article"
    },
    {
      "id": 4,
      "user_id": 2,
      "post_id": 1,
      "text": "I've found a workout buddy. Thanks a lot!"
    }
  ],
  "users": [
    {
      "id": 1,
      "nickname": "Alina Dvoriannykova",
      "email": "dvoriann",
      "password": "$2b$12$ZRixrqfA9YceXnz3OIy1me0xgK2DgPPH.SCcgWn21hw0VFaFmrNdu",
      "image": "1672162120933_IMG_4131.JPG",
      "description": "Some description"
    },
    {
      "id": 2,
      "nickname": "Ho Best",
      "email": "ho.best@gmail.com",
      "password": "$2b$12$/uyd38JWsDJEgQhDhZSbh.7Qrvfk3HEFmryZ5wLG3sDqhi7SdfZpG",
      "image": "1673051207670_hobestavatar.jpg",
      "description": "Hi everyone! My name is Ho Best and I am British. I finished the full course about anatomy and nutrition. These are the main topics of my articles. You are welcome to save and share it with ypur friends. Hope you will find it useful and interesting! "
    },
    {
      "id": 3,
      "nickname": "Anonymous",
      "email": "dvoryannykova@gmail.com",
      "password": "$2b$12$9oCSwfZyi38YKvI1VDlq/e1CR2yTSLGbxQi.PKeeyKgyv6zEmNIXu",
      "image": "",
      "description": "I am a new user here!"
    }
  ]
}